backend/app/Services/AuthService.php

SELECT *
FROM `users`
WHERE `email` = 'user2@bsu.edu.ph'
 LIMIT 1
---
    public function login(string $email, string $password)
    {
        $user = $this->userModel->where('email', $email)->first();

SELECT *
FROM `users`
WHERE `users`.`id` = '5'
---
    public function validateUser($token = null)
    {
        // Session-based authentication only.
        if (session()->get('isLoggedIn')) {
            return $this->userModel->find(session()->get('id')); // Returns Entity