backend/app/Services/ResearchService.php

    public function enqueueIndexJob(int $researchId, string $reason = 'update', int $priority = 100): ?int
    {
        if ($researchId <= 0 || !$this->hasIndexJobsTable()) {
            return null;
        }

        $priority = max(1, min(1000, $priority));
        $now = date('Y-m-d H:i:s');

        $existing = $this->indexJobModel
            ->where('research_id', $researchId)
            ->whereIn('status', ['pending', 'processing'])
            ->orderBy('id', 'DESC')
            ->first();

        if ($existing) {
            $this->indexJobModel->update((int) $existing['id'], [
                'reason' => mb_substr($reason, 0, 100),
                'priority' => min((int) ($existing['priority'] ?? $priority), $priority),
                'next_retry_at' => null,
                'updated_at' => $now,
            ]);
            return (int) $existing['id'];
        }

        $id = $this->indexJobModel->insert([
            'research_id' => $researchId,
            'status' => 'pending',
            'reason' => mb_substr($reason, 0, 100),
            'attempt_count' => 0,
            'max_attempts' => $this->getIndexMaxAttempts(),
            'priority' => $priority,
            'next_retry_at' => null,
            'created_at' => $now,
            'updated_at' => $now,
        ], true);
---
SELECT *
FROM `research_index_jobs`
WHERE `research_id` = 58
AND `status` IN ('pending','processing')
ORDER BY `id` DESC
 LIMIT 1
INSERT INTO `research_index_jobs` (`research_id`, `status`, `reason`, `attempt_count`, `max_attempts`, `priority`, `next_retry_at`, `created_at`, `updated_at`) VALUES (58, 'pending', 'update', 0, 3, 90, NULL, '2026-04-21 09:03:33', '2026-04-21 09:03:33')

    private function completeIndexJob(int $jobId): void
    {
        if ($jobId <= 0 || !$this->hasIndexJobsTable()) {
            return;
        }

        $now = date('Y-m-d H:i:s');
        $this->indexJobModel->update($jobId, [
            'status' => 'completed',
            'last_error' => null,
            'next_retry_at' => null,
            'completed_at' => $now,
            'updated_at' => $now,
        ]);
---
UPDATE `research_index_jobs` SET `status` = 'completed', `last_error` = NULL, `next_retry_at` = NULL, `completed_at` = '2026-04-21 09:03:33', `updated_at` = '2026-04-21 09:03:33'
WHERE `research_index_jobs`.`id` IN (7)

    public function refreshSearchIndex(int $researchId): bool
    {
        if (!$this->hasSearchTextColumn()) {
            return false;
        }

        $row = $this->db->table('researches')
            ->select('researches.id, researches.title, researches.author, researches.crop_variation, researches.file_path, research_details.knowledge_type, research_details.publisher, research_details.isbn_issn, research_details.subjects, research_details.physical_description, research_details.shelf_location')
            ->join('research_details', 'researches.id = research_details.research_id', 'left')
            ->where('researches.id', $researchId)
            ->get()
            ->getRowArray();
---
SELECT `researches`.`id`, `researches`.`title`, `researches`.`author`, `researches`.`crop_variation`, `researches`.`file_path`, `research_details`.`knowledge_type`, `research_details`.`publisher`, `research_details`.`isbn_issn`, `research_details`.`subjects`, `research_details`.`physical_description`, `research_details`.`shelf_location`
FROM `researches`
LEFT JOIN `research_details` ON `researches`.`id` = `research_details`.`research_id`
WHERE `researches`.`id` = 58


        $searchText = $this->buildSearchIndexText($research, $details, (string) ($row['file_path'] ?? ''));

        $this->db->table('research_details')
            ->where('research_id', $researchId)
            ->set([
                'search_text' => $searchText,
            ])
            ->update();
---
UPDATE `research_details` SET `search_text` = 'title Ex commodi sunt ali author Recusandae Et et do crop Yam Minisetts type Journal, Book, Thesis publisher Ea quia praesentium isbn Tempor commodo asper subjects Quo ex aut voluptate description Magna nostrud aut vo shelf Voluptatibus asperio pdf'
WHERE `research_id` = 58

    public function getTopViewedApproved(int $limit = 5, bool $includePrivate = false)
    {
        $safeLimit = max(1, min(50, $limit));

        $builder = $this->researchModel->select($this->selectString)
            ->join('research_details', 'researches.id = research_details.research_id', 'left')
            ->where('researches.status', 'approved');

        if ($this->hasAccessLevelColumn() && !$includePrivate) {
            $builder->where('researches.access_level', 'public');
        }

        if ($this->hasViewCountColumn()) {
            $builder->orderBy('COALESCE(researches.view_count, 0)', 'DESC', false);
        }

        return $builder
            ->orderBy('researches.created_at', 'DESC')
            ->limit($safeLimit)
            ->findAll();
---
SELECT `researches`.*, `research_details`.`knowledge_type`, `research_details`.`publication_date`, `research_details`.`edition`, `research_details`.`publisher`, `research_details`.`physical_description`, `research_details`.`isbn_issn`, `research_details`.`subjects`, `research_details`.`shelf_location`, `research_details`.`item_condition`, `research_details`.`link`
FROM `researches`
LEFT JOIN `research_details` ON `researches`.`id` = `research_details`.`research_id`
WHERE `researches`.`status` = 'approved'
ORDER BY COALESCE(researches.view_count, 0) DESC, `researches`.`created_at` DESC
 LIMIT 5

    public function getMySubmissions(int $userId)
    {
        return $this->researchModel->select($this->selectString)
            ->join('research_details', 'researches.id = research_details.research_id', 'left')
            ->where('researches.uploaded_by', $userId)
            ->where('researches.status !=', 'archived')
            ->orderBy('researches.created_at', 'DESC')
            ->findAll();
---
SELECT `researches`.*, `research_details`.`knowledge_type`, `research_details`.`publication_date`, `research_details`.`edition`, `research_details`.`publisher`, `research_details`.`physical_description`, `research_details`.`isbn_issn`, `research_details`.`subjects`, `research_details`.`shelf_location`, `research_details`.`item_condition`, `research_details`.`link`
FROM `researches`
LEFT JOIN `research_details` ON `researches`.`id` = `research_details`.`research_id`
WHERE `researches`.`uploaded_by` = 3
AND `researches`.`status` != 'archived'
ORDER BY `researches`.`created_at` DESC

    public function getPending()
    {
        return $this->researchModel->select($this->selectString)
            ->join('research_details', 'researches.id = research_details.research_id', 'left')
            ->where('researches.status', 'pending')
            ->orderBy('researches.created_at', 'ASC')
            ->findAll();
---
SELECT `researches`.*, `research_details`.`knowledge_type`, `research_details`.`publication_date`, `research_details`.`edition`, `research_details`.`publisher`, `research_details`.`physical_description`, `research_details`.`isbn_issn`, `research_details`.`subjects`, `research_details`.`shelf_location`, `research_details`.`item_condition`, `research_details`.`link`
FROM `researches`
LEFT JOIN `research_details` ON `researches`.`id` = `research_details`.`research_id`
WHERE `researches`.`status` = 'pending'
ORDER BY `researches`.`created_at` ASC

    public function getStats()
    {
        $approved = $this->researchModel->where('status', 'approved')->countAllResults();
        $pending = $this->researchModel->where('status', 'pending')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `researches`
WHERE `status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `researches`
WHERE `status` = 'pending'

    public function getUserStats(int $userId)
    {
        $myPublished = $this->researchModel->where('uploaded_by', $userId)->where('status', 'approved')->countAllResults();
        $myPending = $this->researchModel->where('uploaded_by', $userId)->where('status', 'pending')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `researches`
WHERE `uploaded_by` = 4
AND `status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `researches`
WHERE `uploaded_by` = 4
AND `status` = 'pending'

    public function getResearch(int $id)
    {
        return $this->researchModel->select($this->selectString)
            ->join('research_details', 'researches.id = research_details.research_id', 'left')
            ->where('researches.id', $id)
            ->first();
---
SELECT `researches`.*, `research_details`.`knowledge_type`, `research_details`.`publication_date`, `research_details`.`edition`, `research_details`.`publisher`, `research_details`.`physical_description`, `research_details`.`isbn_issn`, `research_details`.`subjects`, `research_details`.`shelf_location`, `research_details`.`item_condition`, `research_details`.`link`
FROM `researches`
LEFT JOIN `research_details` ON `researches`.`id` = `research_details`.`research_id`
WHERE `researches`.`id` = 58
 LIMIT 1

    public function checkDuplicate($title, $author, $isbn, $edition, $excludeId = null)
    {
        $builder = $this->db->table('researches');
        $builder->join('research_details', 'researches.id = research_details.research_id');

        // 1. Strict Title Check
        $builder->where('researches.title', $title);

        // 2. Strict Author Check (to allow same title by different authors)
        $builder->where('researches.author', $author);

        // 3. Strict Edition Check
        // If edition provided, match it. If empty, match ONLY empty/null editions.
        if (!empty($edition)) {
            $builder->where('research_details.edition', $edition);
        }
        else {
            $builder->groupStart()
                ->where('research_details.edition', '')
                ->orWhere('research_details.edition', null)
                ->groupEnd();
        }

        if ($excludeId) {
            $builder->where('researches.id !=', $excludeId);
        }

        if ($builder->countAllResults() > 0) {
---
SELECT COUNT(*) AS `numrows`
FROM `researches`
JOIN `research_details` ON `researches`.`id` = `research_details`.`research_id`
WHERE `researches`.`title` = 'Ex commodi sunt ali'
AND `researches`.`author` = 'Recusandae Et et do'
AND `research_details`.`edition` = 'Non laudantium cill'
AND `researches`.`id` != '58'

    public function updateResearch(int $id, int $userId, string $userRole, array $data, $file)
    {
        $item = $this->researchModel->find($id);
---
SELECT *
FROM `researches`
WHERE `researches`.`id` = 58

            }
            $mainUpdate['file_path'] = $newName;
        }
        $this->researchModel->update($id, $mainUpdate);
---
UPDATE `researches` SET `title` = 'Ex commodi sunt ali', `author` = 'Recusandae Et et do', `crop_variation` = 'Yam Minisetts', `status` = 'pending', `rejected_at` = NULL, `updated_at` = '2026-04-21 09:03:33'
WHERE `researches`.`id` IN (58)

        if ($item->status === 'rejected' && $userRole !== 'admin') {
            if (!empty($data['resubmit_remarks']) && trim($data['resubmit_remarks']) !== '') {
                // Get the user's name
                $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 5

            }

            // Notify Admins about the resubmission
            $admins = $this->userModel->where('role', 'admin')->findAll();
---
SELECT *
FROM `users`
WHERE `role` = 'admin'

    public function setStatus(int $id, string $status, object $adminUser, string $messageTemplate, string $comment = '')
    {
        // For Approve/Reject/Archive
        $data = ['status' => $status];
        if ($status === 'approved')
            $data['approved_at'] = date('Y-m-d H:i:s');
        if ($status === 'rejected')
            $data['rejected_at'] = date('Y-m-d H:i:s');
        if ($status === 'archived')
            $data['archived_at'] = date('Y-m-d H:i:s');

        // For Restore
        if ($status === 'pending') {
            $data['rejected_at'] = null;
            $data['archived_at'] = null;
        }

        $this->db->transStart();
        $this->researchModel->update($id, $data);

        $item = $this->researchModel->find($id);
---
UPDATE `researches` SET `status` = 'rejected', `rejected_at` = '2026-04-21 09:16:51', `updated_at` = '2026-04-21 09:16:51'
WHERE `researches`.`id` IN (58)
SELECT *
FROM `researches`
WHERE `researches`.`id` = 58