backend/app/Helpers/activity_helper.php

    function log_activity($userId, $userName, $role, $action, $details = null)
    {
        $logModel = new ActivityLogModel();

        $data = [
            'user_id'    => $userId,
            'user_name'  => $userName ?: 'Guest',
            'role'       => $role ?: 'guest',
            'action'     => strtoupper($action),
            'details'    => $details,
            'ip_address' => service('request')->getIPAddress(),
        ];

        try {
            $logModel->insert($data);
---
INSERT INTO `activity_logs` (`user_id`, `user_name`, `role`, `action`, `details`, `ip_address`, `created_at`) VALUES ('5', 'user2', 'user', 'UPDATE_RESEARCH', 'Updated research ID: 58 (Ex commodi sunt ali)', '192.168.60.2', '2026-04-21 09:03:33')