backend/app/Controllers/AdminController.php

SELECT `id`, `name`, `email`, `role`, `created_at`
FROM `users`
ORDER BY `created_at` DESC
---
    public function index()
    {
        // 🔒 SECURITY CHECK: Strict Admin Only
        // We check the session because we are using cookies
        if (session()->get('role') !== 'admin') {
             return $this->failForbidden('Access Denied: Admins only.');
        }

        // ❌ REMOVED: Manual CORS headers
        // The Global App\Filters\Cors handles this safely now.

        // 2. Fetch Users
        $userModel = new UserModel();

        // Select specific fields (security best practice: don't send passwords)
        $users = $userModel->select('id, name, email, role, created_at')
                           ->orderBy('created_at', 'DESC')
                           ->findAll();