backend/app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function verify()
    {
        // 🔒 Call this explicitly to force CodeIgniter to generate the secure
        // CSRF Token and attach it to the browser's Set-Cookie header automatically.
        csrf_hash();

        $sessionData = $this->authService->verifySession();

        if (!$sessionData) {
            return $this->response->setJSON([
                'status' => 'guest',
                'message' => 'User is not logged in'
            ]);
        }

        // Check if user must change their password (survives page reloads)
        $userModel = new \App\Models\UserModel();
        $dbUser = $userModel->find($sessionData['id']);